フィーチャ: 二値以外 テスト1

シナリオ: 二値以外_テスト1_00001_D3:D8
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト1_00002_E3:E8
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00003_F3:F8
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト1_00004_G3:G8
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00005_H3:H8
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト1_00006_I3:I8
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00007_J3:J8
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar2"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00008_K3:K8
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 ""
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00009_L3:L8
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 ""
  パスワードを入力 "bar"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00010_M3:M8
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige"
  "マイページ"へ移動

シナリオ: 二値以外_テスト1_00011_N3:N8
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "bar"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00012_O3:O8
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige2"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00013_P3:P8
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 ""
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト1_00014_Q3:Q8
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 ""
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

