フィーチャ: 二値以外 テスト2

シナリオ: 二値以外_テスト2_00001_E4:E9
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト2_00002_F4:F9
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00003_G4:G9
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト2_00004_H4:H9
  ユーザー名fooパスワードbarがいる
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00005_I4:I9
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar"
  "マイページ"へ移動

シナリオ: 二値以外_テスト2_00006_J4:J9
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00007_K4:K9
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 "bar2"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00008_L4:L9
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 "foo"
  パスワードを入力 ""
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00009_M4:M9
  ユーザー名fooパスワードbarがいる
  ユーザー名を入力 ""
  パスワードを入力 "bar"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00010_N4:N9
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige"
  "マイページ"へ移動

シナリオ: 二値以外_テスト2_00011_O4:O9
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "bar"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00012_P4:P9
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 "hige2"
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00013_Q4:Q9
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 "hoge"
  パスワードを入力 ""
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 二値以外_テスト2_00014_R4:R9
  ユーザー名hogeパスワードhigeがいる
  ユーザー名を入力 ""
  パスワードを入力 "hige"
  "ユーザー名またはパスワードが違います"と表示

