フィーチャ: 飛び地 テスト1

シナリオ: 飛び地_テスト1_00001_C2:C15
  ログイン可能なユーザーが存在
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 飛び地_テスト1_00002_D2:D15
  ログイン可能なユーザーが存在
  正しいパスワードを入力
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 飛び地_テスト1_00003_E2:E15
  ログイン可能なユーザーが存在
  正しいユーザー名を入力
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 飛び地_テスト1_00004_F2:F15

シナリオ: 飛び地_テスト1_00005_G2:G15

シナリオ: 飛び地_テスト1_00006_H2:H15

シナリオ: 飛び地_テスト1_00007_I2:I15
  ログイン可能なユーザーが存在
  正しいユーザー名を入力
  正しいパスワードを入力
  "マイページ"へ移動

シナリオ: 飛び地_テスト1_00008_J2:J15
  ログイン可能なユーザーが存在
  "ユーザー名またはパスワードが違います"と表示

シナリオ: 飛び地_テスト1_00009_K2:K15

シナリオ: 飛び地_テスト1_00010_L2:L15

シナリオ: 飛び地_テスト1_00011_M2:M15

シナリオ: 飛び地_テスト1_00012_N2:N15

シナリオ: 飛び地_テスト1_00013_O2:O15

シナリオ: 飛び地_テスト1_00014_P2:P15

シナリオ: 飛び地_テスト1_00015_Q2:Q15

シナリオ: 飛び地_テスト1_00016_R2:R15

シナリオ: 飛び地_テスト1_00017_S2:S15

シナリオ: 飛び地_テスト1_00018_T2:T15

シナリオ: 飛び地_テスト1_00019_U2:U15

シナリオ: 飛び地_テスト1_00020_V2:V15

シナリオ: 飛び地_テスト1_00021_W2:W15

シナリオ: 飛び地_テスト1_00022_X2:X15

シナリオ: 飛び地_テスト1_00023_Y2:Y15

シナリオ: 飛び地_テスト1_00024_Z2:Z15

シナリオ: 飛び地_テスト1_00025_AA2:AA15

シナリオ: 飛び地_テスト1_00026_AB2:AB15

シナリオ: 飛び地_テスト1_00027_AC2:AC15
  ログイン可能なユーザーが存在
  "ユーザー名またはパスワードが違います"と表示

