# language: ja

フィーチャ: 飛び地 テスト1

シナリオ: No.1 C2:C15
 * ログイン可能なユーザーが存在
 * "ユーザー名またはパスワードが違います"と表示

シナリオ: No.2 D2:D15
 * ログイン可能なユーザーが存在
 * 正しいパスワードを入力
 * "ユーザー名またはパスワードが違います"と表示

シナリオ: No.3 E2:E15
 * ログイン可能なユーザーが存在
 * 正しいユーザー名を入力
 * "ユーザー名またはパスワードが違います"と表示

シナリオ: No.4 F2:F15

シナリオ: No.5 G2:G15

シナリオ: No.6 H2:H15

シナリオ: No.7 I2:I15
 * ログイン可能なユーザーが存在
 * 正しいユーザー名を入力
 * 正しいパスワードを入力
 * "マイページ"へ移動

シナリオ: No.8 J2:J15
 * ログイン可能なユーザーが存在
 * "ユーザー名またはパスワードが違います"と表示

シナリオ: No.9 K2:K15

シナリオ: No.10 L2:L15

シナリオ: No.11 M2:M15

シナリオ: No.12 N2:N15

シナリオ: No.13 O2:O15

シナリオ: No.14 P2:P15

シナリオ: No.15 Q2:Q15

シナリオ: No.16 R2:R15

シナリオ: No.17 S2:S15

シナリオ: No.18 T2:T15

シナリオ: No.19 U2:U15

シナリオ: No.20 V2:V15

シナリオ: No.21 W2:W15

シナリオ: No.22 X2:X15

シナリオ: No.23 Y2:Y15

シナリオ: No.24 Z2:Z15

シナリオ: No.25 AA2:AA15

シナリオ: No.26 AB2:AB15

シナリオ: No.27 AC2:AC15
 * ログイン可能なユーザーが存在
 * "ユーザー名またはパスワードが違います"と表示

